# Import Libraries, Datasets and visualisations

In [1]:
import os
import pandas as pd
import numpy as np
import time
from datetime import datetime

In [2]:
name_path = os.path.join("Data", "name.basics.tsv")
df_name = pd.read_csv(name_path, delimiter="\t")

In [3]:
df_name.set_index("nconst").head()

,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
nconst,,,,,
nm0000001,Fred Astaire,1899,1987,"actor,miscellaneous,producer","tt0072308,tt0050419,tt0027125,tt0025164"
nm0000002,Lauren Bacall,1924,2014,"actress,miscellaneous,soundtrack","tt0037382,tt0075213,tt0038355,tt0117057"
nm0000003,Brigitte Bardot,1934,\N,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"
nm0000004,John Belushi,1949,1982,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050986,tt0069467,tt0050976,tt0083922"

In [4]:
title_akas_path = os.path.join("Data", "title.akas.tsv")
df_title_akas = pd.read_csv(title_akas_path, sep="\t")

In [5]:
df_title_akas.set_index("titleId").head()

,ordering,title,region,language,types,attributes,isOriginalTitle
titleId,,,,,,,
tt0000001,1,Carmencita,\N,\N,original,\N,1
tt0000001,2,Carmencita,DE,\N,\N,literal title,0
tt0000001,3,Carmencita,US,\N,imdbDisplay,\N,0
tt0000001,4,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
tt0000001,5,Καρμενσίτα,GR,\N,imdbDisplay,\N,0

In [6]:
title_basics_path = os.path.join("Data", "title.basics.tsv")
df_title_basics = pd.read_csv(title_basics_path, sep="\t")

In [7]:
df_title_basics.set_index("tconst").head()

,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
tconst,,,,,,,,
tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
tt0000003,short,Poor Pierrot,Pauvre Pierrot,0,1892,\N,5,"Animation,Comedy,Romance"
tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,Short

In [8]:
title_crew_path = os.path.join("Data", "title.crew.tsv")
df_title_crew = pd.read_csv(title_crew_path, sep="\t")

In [9]:
df_title_crew.set_index("tconst").head()

           directors    writers
tconst
tt0000001  nm0005690         \N
tt0000002  nm0721526         \N
tt0000003  nm0721526  nm0721526
tt0000004  nm0721526         \N
tt0000005  nm0005690         \N

In [10]:
title_episode_path = os.path.join("Data", "title.episode.tsv")
df_title_episode = pd.read_csv(title_episode_path, sep="\t")

In [11]:
df_title_episode.set_index("tconst").head()

          parentTconst seasonNumber episodeNumber
tconst
tt0031458   tt32857063           \N            \N
tt0041951    tt0041038            1             9
tt0042816    tt0989125            1            17
tt0042889    tt0989125           \N            \N
tt0043426    tt0040051            3            42

In [12]:
title_principals_path = os.path.join("Data", "title.principals.tsv")
df_title_principals = pd.read_csv(title_principals_path, sep="\t")

In [13]:
df_title_principals.set_index("tconst").head()

,ordering,nconst,category,job,characters
tconst,,,,,
tt0000001,1,nm1588970,self,\N,"[""Self""]"
tt0000001,2,nm0005690,director,\N,\N
tt0000001,3,nm0005690,producer,producer,\N
tt0000001,4,nm0374658,cinematographer,director of photography,\N
tt0000002,1,nm0721526,director,\N,\N

In [14]:
title_ratings_path = os.path.join("Data", "title.ratings.tsv")
df_title_ratings = pd.read_csv(title_ratings_path, sep="\t")

In [15]:
df_title_ratings.set_index("tconst").head()

           averageRating  numVotes
tconst
tt0000001            5.7      2185
tt0000002            5.5       306
tt0000003            6.4      2269
tt0000004            5.2       196
tt0000005            6.2      3010

# Questions

2. How many total people in data set?

In [213]:
nb_people = len(df_name.index)
print(f"Total people in dataset: {nb_people}")

Total people in dataset: 14897122

3. What is the earliest year of birth?

In [214]:
earliest_year_birth = df_name["birthYear"].min()
print(f"Earliest year of birth: {earliest_year_birth}")

Earliest year of birth: 100

4. How many years ago was this person born?

In [215]:
time_actuel = time.time()
year_actuel = datetime.fromtimestamp(time_actuel).year
print(f"This person was born {year_actuel - int(earliest_year_birth)} years ago")

This person was born 1925 years ago

5. Using only the data in the data set, determine if this date of birth correct.

In [216]:
oldest_person = df_name[df_name["birthYear"] == earliest_year_birth]
# .iloc[0] to avoid a warning
Death_Year = int(oldest_person["deathYear"].iloc[0])
age_person = Death_Year - int(earliest_year_birth)
print(f"Age of the person at death: {age_person} years old (Death Year: {int(oldest_person["deathYear"].iloc[0])})")

Age of the person at death: -56 years old (Death Year: 44)

6. Explain the reasoning for the answer in a code comment or new markdown cell.

By finding the person born in year 100, we can compare his date of birth and death. We can see that this person is dead at -56 years old. Either the date of birth or death is incorrect

7. What is the most recent data of birth?

In [217]:
# 'coerce' replace any elements that are not numbers (especially in our case the '\N') by NaN
numeric_birth_year = pd.to_numeric(df_name["birthYear"], errors='coerce')

In [218]:
# max() ignores  NaN but not \N
recent_year_birth = int(numeric_birth_year.max())
print(f"Most recent year of birth: {recent_year_birth}")

Most recent year of birth: 2025

8. What percentage of the people do not have a listed date of birth?

In [219]:
no_birthYear = numeric_birth_year.isna().sum()
total = df_name["nconst"].nunique()

In [220]:
percentage_missing = (no_birthYear/total)*100
print(f"{percentage_missing:.2f}% of people have no birth date.")

95.57% of people have no birth date.

9. What is the length of the longest "short" after 1900?

In [221]:
df_after_1900 = df_title_basics[df_title_basics["startYear"] >= "1900"]

In [222]:
df_short_after_1900 = df_after_1900[df_after_1900["titleType"] == "short"]

In [223]:
numeric_length_short = pd.to_numeric(df_short_after_1900["runtimeMinutes"], errors='coerce')
max_length_short = int(numeric_length_short.max())

In [224]:
print(f"The longest 'short' after 1900 lasts {max_length_short} Minutes")

The longest 'short' after 1900 lasts 1311 Minutes

10. What is the length of the shortest "movie" after 1900?

In [225]:
df_movies_after_1900 = df_after_1900[df_after_1900["titleType"] == "movie"]

In [226]:
numeric_length_movie = pd.to_numeric(df_movies_after_1900["runtimeMinutes"], errors='coerce')
min_length_movie = int(numeric_length_movie.min())

In [227]:
print(f"The shortest 'movie' after 1900 lasts {min_length_movie} Minutes")

The shortest 'movie' after 1900 lasts 1 Minutes

11. List of all of the genres represented.

In [228]:
# Splits the multi-genre strings (separated by commas) into multiple columns, 
# then stacks all non-missing values into a single Series.
tous_les_genres = df_title_basics["genres"].str.split(',', expand=True).stack()

In [229]:
liste_genre_unique = list(tous_les_genres.unique())

In [230]:
liste_genre_unique.remove("\\N")

In [231]:
print(f"{"-"*10} List of all the genres {"-"*10}")
for i, genre in enumerate(liste_genre_unique):
    print(f"{i+1}. {genre}")

---------- List of all the genres ----------
1. Documentary
2. Short
3. Animation
4. Comedy
5. Romance
6. Sport
7. News
8. Drama
9. Fantasy
10. Horror
11. Biography
12. Music
13. War
14. Crime
15. Western
16. Family
17. Adventure
18. Action
19. History
20. Mystery
21. Sci-Fi
22. Musical
23. Thriller
24. Film-Noir
25. Talk-Show
26. Game-Show
27. Reality-TV
28. Adult

12. What is the higest rated comedy "movie" in the dataset? Note, if there is a tie, the tie shall be broken by the movie with the most votes .

In [232]:
df_movie = df_title_basics[df_title_basics["titleType"] == "movie"]

In [233]:
df_movie_comedy = df_movie[df_movie["genres"].str.contains("Comedy", na=False)]

In [234]:
# List of tconst of comedy movies
df_comedy_movie_ratings = df_title_ratings[df_title_ratings["tconst"].isin(df_movie_comedy["tconst"])]

In [235]:
df_comedy_movie_ratings_sorted = df_comedy_movie_ratings.sort_values(["averageRating", "numVotes"], ascending=False)

In [236]:
df_comedy_movie_ratings_sorted.set_index("tconst").head()

            averageRating  numVotes
tconst
tt1423343            10.0        12
tt5533084            10.0        11
tt1543724            10.0         5
tt38876234           10.0         5
tt27203772            9.9        22

In [237]:
tconst_best_rated_movie_comedy = df_comedy_movie_ratings_sorted.iloc[0]["tconst"]

In [238]:
movie = df_title_basics[df_title_basics["tconst"] == tconst_best_rated_movie_comedy]

In [239]:
movie.set_index("tconst").head()

,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
tconst,,,,,,,,
tt1423343,movie,Bob vs. Society,Bob vs. Society,0,2009,\N,90,Comedy

In [240]:
print(f"The best rated and most voted comedy movie is {movie["primaryTitle"].values[0]}")

The best rated and most voted comedy movie is Bob vs. Society

13. Who was the director of the movie?

In [241]:
director = df_title_crew[df_title_crew["tconst"] == tconst_best_rated_movie_comedy]["directors"]

In [242]:
name_director = df_name[df_name["nconst"] == director.values[0]]["primaryName"]

In [243]:
print(f"The director of the movie was {name_director.values[0]}")

The director of the movie was David Pring-Mill

14. List, if any, the alternate titles for the movie.

In [244]:
alternates = df_title_akas[df_title_akas["titleId"] == tconst_best_rated_movie_comedy]

In [245]:
alternates.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
15197113,tt1423343,1,Bob vs. Society,\N,\N,original,\N,1
15197114,tt1423343,2,Bob vs. Society,GB,\N,imdbDisplay,\N,0
15197115,tt1423343,3,Bob vs. Society,US,\N,imdbDisplay,\N,0

In [246]:
df_alt_name = alternates[alternates["isOriginalTitle"] == 0][["title", "region"]]

In [247]:
print(f"{"-"*10} Alternate titles and the region associated {"-"*10}")
display(df_alt_name.set_index("title"))

---------- Alternate titles and the region associated ----------

                region
title
Bob vs. Society     GB
Bob vs. Society     US